app/controllers/accounts_controller.rb

UPDATE "accounts" SET "gender" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["gender", "male"], ["updated_at", "2016-04-20 00:17:48.031933"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)