app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."login" = ? LIMIT 1  [["login", "Matt"]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? LIMIT 1  [["user_id", 12]]
---
  def create
  	login = params[:user][:login]
  	password = params[:user][:password]

  	user = User.find_by login: login

  	if (user && user.authenticate(password))
  	  session[:user_id] = user.id
  	  session[:user_name] = user.account.first_name