app/controllers/todo_items_controller.rb

  def create
  	@item = @list.todo_items.new(items_params)
  	if @item.save
---
INSERT INTO "todo_items" ("task_title", "description", "due_date", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
  	@item = @list.todo_items.find(params[:id])
  	@item.destroy
---
DELETE FROM "tags_todo_items" WHERE "tags_todo_items"."todo_item_id" = ? AND 1=0  [["todo_item_id", 4]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 4]]

    def update
      @item = @list.todo_items.find(params[:id])
      respond_to do |format|
      if @item.update(items_params)
---
UPDATE "todo_items" SET "task_title" = ?, "description" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["task_title", "Let's go to China!"], ["description", "sample description"], ["updated_at", "2016-04-20 11:06:57.426065"], ["id", 12]]