app/controllers/todo_lists_controller.rb

SELECT COUNT(*) FROM "todo_lists" WHERE "todo_lists"."user_id" = ?  [["user_id", 24]]
---
  def index
    @todo_lists = current_user.todo_lists.paginate(page: params[:page], per_page: 5)

SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 14]]
---
  def show
    @items  = @todo_list.todo_items.paginate(page: params[:page], per_page:3)

INSERT INTO "todo_lists" ("list_name", "list_due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["list_name", "New Todo List"], ["list_due_date", "2016-04-19"], ["created_at", "2016-04-19 02:26:43.631351"], ["updated_at", "2016-04-19 02:26:43.631351"]]
---
  def create
    @todo_list = current_user.todo_lists.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save